railsMockup/app/controllers/tours_controller.rb

SELECT "tours".* FROM "tours"
---
  def index
    @tours = Tour.all

SELECT "tours".* FROM "tours" WHERE "tours"."id" = 1 LIMIT 1
---
  def show
    @tour = Tour.find(params[:id])

INSERT INTO "tours" ("name", "created_at", "updated_at", "desc") VALUES ('Site Seeting', '2011-09-26 03:14:15.164758', '2011-09-26 03:14:15.164758', 'Space needle and other boring stuff')
---
  def create
    @tour = Tour.new(params[:tour])

    respond_to do |format|
      if @tour.save